let t=0;
dt=0.1;

function setup() {
	createCanvas(500, 500); //размер холста 500х500, чтобы влазил во все экраны
	
}

function draw() {
	//background(250, 235, 215); // светлый цвет фона
	t=t+dt;
	if ((t>10)||(t<0)) {
		dt=-dt;
		//t=-t;
	}
	//rotate(radians(cos(sin(x))));
	translate(width / 2, height / 2); //переносим начало координат в центр холста
	scale(1, -1); // разворачиваю систему координат вверх игреком
	//рисуем сам щит

	fill(178, 34, 34); // заливка вишневым цветом
	ellipse(200*(cos(t)-cos(6.5*t)/6.5), 200*(sin(t)-sin(6.5*t)/6.5), 30, 30); //рисую самый большой(1) контур щита
	fill(220, 220, 220); // заливка светлым цветом
//	ellipse(2*t*sin(t), -2*t*cos(t), 250, 250); //рисую 2 контур щита
	fill(178, 34, 34); // заливка вишневым цветом
	ellipse(15*t*sin(t), -15*t*cos(t), 190, 190); //рисую 3 контур щита
	fill(30, 144, 255); // заливка голубым цветом
	ellipse(-15*t*sin(t), 15*t*cos(t), 130, 130); //рисую 4 контур щита

	//рисуем пятиконечную звезду

	fill(220, 220, 220); // заливка светлым цветом
	triangle(11.5*(cos(t)+cos(5*t)/5)-15, 11.5*(sin(t)-sin(5*t)/5)+20, 11.5*(cos(t)+cos(5*t)/5), 11.5*(sin(t)-sin(5*t)/5)+65, 11.5*(cos(t)+cos(5*t)/5)+15, 11.5*(sin(t)-sin(5*t)/5)+20); //рисуем звезду, 1 треугольник
	rotate(radians(-72));
	triangle(11.5*(cos(t)+cos(5*t)/5)-15, 11.5*(sin(t)-sin(5*t)/5)+20, 11.5*(cos(t)+cos(5*t)/5), 11.5*(sin(t)-sin(5*t)/5)+65, 11.5*(cos(t)+cos(5*t)/5)+15, 11.5*(sin(t)-sin(5*t)/5)+20); //рисуем звезду, 2 треугольник
	rotate(radians(-72));
	triangle(11.5*(cos(t)+cos(5*t)/5)-15, 11.5*(sin(t)-sin(5*t)/5)+20, 11.5*(cos(t)+cos(5*t)/5), 11.5*(sin(t)-sin(5*t)/5)+65, 11.5*(cos(t)+cos(5*t)/5)+15, 11.5*(sin(t)-sin(5*t)/5)+20); //рисуем звезду, 3 треугольник
	rotate(radians(-72));
	triangle(11.5*(cos(t)+cos(5*t)/5)-15, 11.5*(sin(t)-sin(5*t)/5)+20, 11.5*(cos(t)+cos(5*t)/5), 11.5*(sin(t)-sin(5*t)/5)+65, 11.5*(cos(t)+cos(5*t)/5)+15, 11.5*(sin(t)-sin(5*t)/5)+20); //рисуем звезду, 4 треугольник
	rotate(radians(-72));
	triangle(11.5*(cos(t)+cos(5*t)/5)-15, 11.5*(sin(t)-sin(5*t)/5)+20, 11.5*(cos(t)+cos(5*t)/5), 11.5*(sin(t)-sin(5*t)/5)+65, 11.5*(cos(t)+cos(5*t)/5)+15, 11.5*(sin(t)-sin(5*t)/5)+20); //рисуем звезду, 5 треугольник
	
	push();
	rotate(radians(-36));
	//noStroke(); //убираем обводку
	ellipse(11.5*(cos(t)+cos(5*t)/5), 11.5*(sin(t)-sin(5*t)/5), 50, 50); // кругом закрашиваем область в середине
	pop();

}